
&НаКлиенте
Процедура ПрименитьИЗакрыть(Команда)
	
	СтруктураЗакрытия = Новый Структура();
	Если ЗначениеЗаполнено(РежимОбмена) Тогда
		СтруктураЗакрытия.Вставить("РежимОбмена", РежимОбмена);	
	КонецЕсли;     
	Если ЗначениеЗаполнено(СостояниеОбмена) Тогда
		СтруктураЗакрытия.Вставить("СостояниеОбмена", СостояниеОбмена);	
	КонецЕсли; 
	Если ЗначениеЗаполнено(НастройкаКД) Тогда
		СтруктураЗакрытия.Вставить("НастройкаКД", НастройкаКД);	
	КонецЕсли; 
	Если ИзменитьИмяФайлаОбмена = Истина Тогда
		СтруктураЗакрытия.Вставить("ИмяФайлаОбмена", ИмяФайлаОбмена);	
	КонецЕсли; 
	Если ЗначениеЗаполнено(ИДБазыПриемник) Тогда
		СтруктураЗакрытия.Вставить("ИДБазыПриемник", ИДБазыПриемник);	
	КонецЕсли; 
	СтруктураЗакрытия = ?(СтруктураЗакрытия.Количество() = 0, Неопределено, СтруктураЗакрытия);	
	Закрыть(СтруктураЗакрытия);
	
КонецПроцедуры
