
&НаКлиенте
Процедура УдалитьНеАктуальныеЦены(Команда)
	УдалитьНеАктуальныеЦеныНаСервере();
КонецПроцедуры

&НаСервере
Процедура УдалитьНеАктуальныеЦеныНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		//"ВЫБРАТЬ Первые 10
		"ВЫБРАТЬ 
		|	ЦеныНоменклатуры.Период КАК Период,
		|	ЦеныНоменклатуры.ВидЦен КАК ВидЦен,
		|	ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатуры.Характеристика КАК Характеристика,
		|	ЦеныНоменклатуры.Цена КАК Цена,
		|	ЦеныНоменклатуры.Актуальность КАК Актуальность,
		|	ЦеныНоменклатуры.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
		|ГДЕ
		|	(ЦеныНоменклатуры.Актуальность = ЛОЖЬ
		|			ИЛИ НЕ ЦеныНоменклатуры.ЕдиницаИзмерения.Код ЕСТЬ NULL)";
	
	РезультатЗапроса = Запрос.Выполнить();
		
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли; 
	
	ВДЗ = РезультатЗапроса.Выбрать();  
	
	//Ограничение транзакции 
	ПрерватьЦикл = Ложь; 
	ОбъемТранзакции = 500;
	
	ТекТранз = ОбъемТранзакции;
	Осч = 1;
	Сч = 1;
	
	НачатьТранзакцию();
	
	Пока ВДЗ.Следующий() И ПрерватьЦикл = Ложь Цикл
		
		Попытка
			
			//Обработка данных
			Набор = РегистрыСведений.ЦеныНоменклатуры.СоздатьНаборЗаписей(); 
			Набор.Отбор.Период.Установить(ВДЗ.Период);
			Набор.Отбор.ВидЦен.Установить(ВДЗ.ВидЦен);
			Набор.Отбор.Номенклатура.Установить(ВДЗ.Номенклатура);
			Набор.Отбор.Характеристика.Установить(ВДЗ.Характеристика);
			Набор.Прочитать();
			Набор.Очистить();  
			Набор.ОбменДанными.Загрузка = Истина;
			Набор.Записать();
			
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ОписаниеОшибки();
			Сообщение.Сообщить();
			ОтменитьТранзакцию();
			Возврат;
		КонецПопытки;
		
		Если Сч >= ТекТранз ИЛИ Осч = ВДЗ.Количество() Тогда //Последняя запись
			//Зафиксировать транзакцию
			ЗафиксироватьТранзакцию();
			
			Если Осч <> ВДЗ.Количество() Тогда //Если запись не последняя продолжаем
				ТекТранз = ОбъемТранзакции;
				Сч = 1;
				НачатьТранзакцию();
			КонецЕсли;
			
		КонецЕсли;
	
		Сч = Сч + 1;
		Осч = Осч + 1;
		
	КонецЦикла;
	
КонецПроцедуры
